; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-1-2-10)
(:domain gripper-strips)
(:objects robot1 - robot
rgripper1 lgripper1 - gripper
room1 room2 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 - object)
(:init
(at-robby robot1 room1)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at ball1 room2)
(at ball2 room2)
(at ball3 room2)
(at ball4 room2)
(at ball5 room2)
(at ball6 room1)
(at ball7 room2)
(at ball8 room2)
(at ball9 room1)
(at ball10 room1)
)
(:goal
(and
(at ball1 room2)
(at ball2 room2)
(at ball3 room2)
(at ball4 room1)
(at ball5 room2)
(at ball6 room1)
(at ball7 room2)
(at ball8 room2)
(at ball9 room2)
(at ball10 room1)
)
)
)

; plan
1. (pick robot1 ball9 room1 lgripper1)
   deleted: (at ball9 room1) (free robot1 lgripper1)
   added: (carry robot1 ball9 lgripper1)
   goals met: 8 of 10
2. (move robot1 room1 room2)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room2)
   goals met: 8 of 10
3. (pick robot1 ball4 room2 rgripper1)
   deleted: (at ball4 room2) (free robot1 rgripper1)
   added: (carry robot1 ball4 rgripper1)
   goals met: 8 of 10
4. (drop robot1 ball9 room2 lgripper1)
   deleted: (carry robot1 ball9 lgripper1)
   added: (at ball9 room2) (free robot1 lgripper1)
   goals met: 9 of 10
5. (move robot1 room2 room1)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room1)
   goals met: 9 of 10
6. (drop robot1 ball4 room1 rgripper1)
   deleted: (carry robot1 ball4 rgripper1)
   added: (at ball4 room1) (free robot1 rgripper1)
   goals met: 10 of 10
